# Analiza i Bazy Danych

### Laboratorium nr 2 Łączenie z bazą danych i instrukcja select

Adam Stasiak grupa I

### Zadanie 1

In [1]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')


df = pd.read_sql('select distinct category_id from film_category order by category_id ASC',con=connection)

df

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    category_id
0             1
1             2
2             3
3             4
4             5
5             6
6             7
7             8
8             9
9            10
10           11
11           12
12           13
13           14
14           15
15           16

In [2]:

df_1 = pd.read_sql('select  max(category_id) from film_category',con=connection)
df_1

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   max
0   16

Tabela zawiera 16 różnych kategorii filmów rozróżnianych po numerzy id przypisanym do każdej z kategorii.

### Zadanie 2

In [3]:
df_2 = pd.read_sql('select Name from category order by name asc',con=connection)
df_2

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Zadanie 3

In [4]:
df_3 = pd.read_sql('select title, release_year from film order by release_year desc limit 1',con=connection)
print('najmłodszy film')
df_3

najmłodszy film

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

             title  release_year
0  Chamber Italian          2006

In [5]:
df_4 = pd.read_sql('select title, release_year from film order by release_year asc limit 1',con=connection)
print('najstarszy film')
df_4

najstarszy film

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

             title  release_year
0  Chamber Italian          2006

Baza danych zawiera filmy wydane w 2006 roku

### Zadanie 4

In [6]:
df_5 = pd.read_sql("Select count(rental_id) from rental where rental_date BETWEEN '2005-07-01 00:00:00'::timestamp and '2005-08-01 00:00:00'::timestamp",con = connection)
df_5

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   6709

### Zadanie 5

In [7]:
df_6 = pd.read_sql("select count(rental_date) from rental where rental_date BETWEEN '2010-01-01 00:00:00'::timestamp AND '2011-02-01 00:00:00'::timestamp",con=connection)
df_6

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0      0

### Zadania 6

In [8]:
df_7 = pd.read_sql("select max(amount) from payment",con=connection)
df_7

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     max
0  11.99

Zadanie 7

In [9]:
df_8 = pd.read_sql("select customer.first_name,customer.last_name,country.country \
    from customer \
    left join address on customer.address_id = address.address_id\
    left join city on address.city_id = city.city_id \
    left join country on city.country_id = country.country_id \
    where country.country  = 'Poland' or country.country = 'Nigeria' or country.country = 'Bangladesh'  ",con =connection)
df_8

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   first_name  last_name     country
0       Sonia    Gregory     Nigeria
1       Brian      Wyman      Poland
2      Sidney   Burleson      Poland
3      Rodney    Moeller     Nigeria
4     Stephen     Qualls  Bangladesh
5       Velma      Lucas     Nigeria
6     Marilyn       Ross     Nigeria
7       Elsie     Kelley     Nigeria
8      Gladys   Hamilton     Nigeria
9       Frank   Waggoner  Bangladesh
10   Marjorie     Tucker      Poland
11      Carol     Garcia     Nigeria
12       Leah     Curtis      Poland
13      Ruben      Geary      Poland
14       Olga    Jimenez     Nigeria
15     Bertha   Ferguson     Nigeria
16     Tracey    Barrett     Nigeria
17         Jo     Fowler     Nigeria
18    Johnnie   Chisholm      Poland
19    Wallace      Slone     Nigeria
20   Michelle      Clark  Bangladesh
21    Russell    Brinson      Poland
22     Jimmie  Eggleston      Poland
23  Constance       Reid     Nigeria

W bazie danych znajduje się 23 takich klientów

### Zadanie 8

In [10]:
df_9 = pd.read_sql("Select staff.first_name,staff.last_name,address.address,city.city,country.country\
    From Staff \
    inner join address on staff.address_id = address.address_id \
    inner join city on address.city_id = city.city_id \
    left join country on city.country_id = country.country_id",con=connection)
df_9

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  first_name last_name               address        city    country
0       Mike   Hillyer     23 Workhaven Lane  Lethbridge     Canada
1        Jon  Stephens  1411 Lillydale Drive   Woodridge  Australia

Pracownicy mieszkają w Kanadzie i Australii

### Zadanie 9

In [11]:
df_10 = pd.read_sql("Select staff.first_name,staff.last_name,address.address,city.city,country.country\
    From Staff \
    inner join address on staff.address_id = address.address_id \
    inner join city on address.city_id = city.city_id \
    left join country on city.country_id = country.country_id \
    where country.country = 'Argentina' or country.country = 'Spain' ",con=connection)
df_10

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

Empty DataFrame
Columns: [first_name, last_name, address, city, country]
Index: []

Zapytanie zwraca pustą tabele gdyż na podstawie poprzedniego ćwiczenia, można już zauważyć , że nie ma pracowników z Hiszpani i Argentyny

### Zadanie 10

In [12]:
df_11 = pd.read_sql("Select distinct category.name \
    from rental \
    left join customer on rental.customer_id = customer.customer_id \
    left join inventory on rental.inventory_id = inventory.inventory_id \
    left join film on inventory.film_id = film.film_id \
    left join film_category on film.film_id = film_category.film_id \
    left join category on film_category.category_id = category.category_id\
    order by category.name asc", con=connection)
df_11

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Klienci wyporzycali filmy z 15 różnych kategorii

### Zadanie 11

In [13]:
df_12 = pd.read_sql("Select distinct category.name \
    from rental \
    left join customer on rental.customer_id = customer.customer_id \
    left join address on customer.address_id = address.address_id\
    left join city on address.city_id = city.city_id \
    left join country on city.country_id = country.country_id \
    left join inventory on rental.inventory_id = inventory.inventory_id \
    left join film on inventory.film_id = film.film_id \
    left join film_category on film.film_id = film_category.film_id \
    left join category on film_category.category_id = category.category_id\
    where country.country = 'United States'\
    order by category.name asc", con=connection)
df_12

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

W Ameryce wyporzyczono filmy z 15 różnych kategorii

### Zadanie 12

In [14]:
df_13 = pd.read_sql("select distinct title from film \
    left join film_actor on film.film_id = film_actor.film_id \
    left join actor on film_actor.actor_id = actor.actor_id \
    where (actor.last_name = 'Zellweger' and actor.first_name ='Julia') or (actor.last_name = 'Pfeiffer' and actor.first_name ='Olympia') or (actor.last_name = 'Presley' and actor.first_name ='Ellen')", con=connection)
df_13

c:\Users\DELL\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]

W bazie jest 69 takich filmów